nxp-mcuxpresso/mcux-soc-svd/MCXN235/MCXN235.xml
        <register>
          <name>ELS_KS19</name>
          <description>Status Register</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x41C</resetMask>
          <fields>
            <field>
              <name>KS19_KSIZE</name>
              <description>Key size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>size128</name>
                  <description>128</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size256</name>
                  <description>256</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KS19_KACT</name>
              <description>Key is active</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_KBASE</name>
              <description>First slot in a multislot key</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_FGP</name>
              <description>Hardware Feature General Purpose</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_FRTN</name>
              <description>Hardware Feature Retention</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_FHWO</name>
              <description>Hardware Feature Output</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UKPUK</name>
              <description>CMAC key</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UTECDH</name>
              <description>CMAC key</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UCMAC</name>
              <description>CMAC key</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UKSK</name>
              <description>KSK key</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_URTF</name>
              <description>Real Time Fingerprint key</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UCKDF</name>
              <description>Derivation key for CKDF command</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UHKDF</name>
              <description>Derivation key for HKDF command</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UECSG</name>
              <description>Ecc signing key</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UECDH</name>
              <description>Ecc diffie hellman key</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UAES</name>
              <description>Aes key</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UHMAC</name>
              <description>Hmac key</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UKWK</name>
              <description>Key wrapping key</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UKUOK</name>
              <description>Key unwrapping key</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UTLSPMS</name>
              <description>TLS Pre Master Secret</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UTLSMS</name>
              <description>TLS Master Secret</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UKGSRC</name>
              <description>Supply KEYGEN source</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UHWO</name>
              <description>Hardware out key</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UWRPOK</name>
              <description>Ok to wrap key</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UDUK</name>
              <description>Device Unique Key</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KS19_UPPROT</name>
              <description>Priviledge level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
